# 6. Створіть масив А [1..8] за допомогою генератора випадкових чисел з елементами від -10 до 10 і виведіть
# його на екран. Підрахуйте кількість від’ємних елементів масиву.
# Гевчук Максим КН-А

from random import randint

arr = [randint(-10, 10) for i in range(8)]  # створення масиву розміром 8 з рандомними елементами
count = len(list(filter(lambda x: x < 0, arr)))  # підрахунок від'ємних елементів
print(f'Масив з елементами:\n{arr}')  # виведення
print(f'Кількість від\'ємних елементів:\n{count}')  # виведення
