# 7. Створіть масив А [1..12] за допомогою генератора випадкових чисел з
# елементами від -20 до 10 і виведіть його на екран. Замініть всі від’ємні елементи
# масиву числом 0.
# Гевчук Максим КН-А

import random

arr = [random.randint(-20, 10) for i in range(12)]  # створення масиву розміром 12 з рандомними елементами
print(f'Масив з елементами:\n{arr}')  # виведення
for elem in range(len(arr)):
    if arr[elem] < 0:  # якщо в масиві є від'ємні елементи, то вони замінюються на нуль
        arr[elem] = 0
print(f'Масив із зміненими елементами:\n{arr}')  # виведення
