# 8. Створіть цілочисельний масив А [1..15] за допомогою генератора випадкових чисел з елементами від -15 до 30 і
# виведіть його на екран. Визначте найбільший елемент масиву і його індекс.
# Гевчук Максим КН-А

import random

arr = [random.randint(-15, 30) for i in range(15)]  # створення масиву розміром 15 з рандомними елементами
print(f'Масив з елементами:\n{arr}')  # виведення масиву
print(f'Найбільший елемент: {max(arr)}\n'  # максимальне число
      f'Його індекс: {arr.index(max(arr))}')  # його індекс
