# 12. Дані про температуру повітря за декаду грудня зберігаються в масиві.
# Визначити, скільки раз температура була вище середньої за цю декаду.
# Гевчук Максим КН-А

arr = tuple(map(float, input('Введіть масив даних про температуру через пробіл:\n>>> ').split()))  # ввидення даних
average_t = sum(arr)/len(arr)  # знаходження середньої температури
count_t = len(tuple(filter(lambda x: x > average_t, arr)))  # фільтр та підрахунок темп., що вище середньої
print(f'Середня температура {average_t}°\n'  # виведення
      f'{count_t} разів температура була вище середньої')  # виведення
