# 34. Дано два лінійних масиву однакової розмірності. Скласти третій масив з добутку елементів перших двох масивів,
# що стоять на місцях з однаковим індексом.
# Гевчук Максим КН-А

from numpy import prod

arr1 = list(map(int, input('Введіть елементи 1 масиву через пробіл:\n>>> ').split()))  # введення елементів
arr2 = list(map(int, input('Введіть елементи 2 масиву через пробіл:\n>>> ').split()))
# zip() створює масив пар елементів з однаковим індексом, а prod() перемножує їх
arr3 = list(map(lambda x: prod(x), zip(arr1, arr2)))
print(f'Масив елеменів, які є добутком елементів однакового індексу:\n{arr3}')  # виведення
