# 38. Дані про направлення вітру (північний, південний, східний, західний) і силі вітру за декаду листопада зберігаються
# в масиві. Визначити, скільки днів дув південний вітер з силою, що перевищує 8 м / с.
# Гевчук Максим КН-А

data = []
count = 0
print('Введіть напрям (ПН, ПД, СХ або ЗХ) та швидкість вітру через пробіл: ')
for i in range(10):
    data.append(input(f'{i + 1}.  ').split())  # до загального списку додається список типу ['ПД' , '8']
    data[i][1] = float(data[i][1])  # перетворення другого елементу підсписку в число

    if data[i][0] == 'ПД' and data[i][1] > 8:  # підрахунок днів з ПД вітром та силою > 8 м/с
        count += 1
print(f'{count} днів дув південний вітер з силою, що перевищує 8 м/с')  # виведення
