# 41. Змінній t привласнити значення істина, якщо максимальний елемент одновимірного масиву єдиний і не перевищує
# наперед заданого числа а.
# Гевчук Максим КН-А

from random import randint

t = False  # наша змінна t
arr = [randint(-10, 10) for i in
       range(int(input('Введіть к-сть елементів масиву:\n>>> ')))]  # створення масиву із рандомних елементів
num = int(input('Введіть число:\n>>> '))  # введення числа


if max(arr) < num and arr.count(max(arr)) == 1:  # якщо максимальне число < num і одне, то t = істина
    t = True
print(f'\nМасив:\n{arr}')  # виведення
print(t)
