# 43. Задано два натуральних числа a і b. Змінній w привласнити значення істина,
# якщо в одновимірному цілочисельному масиві є хоча б один елемент, кратний а і не кратний b.
# Гевчук Максим КН-А

from random import randint

w = False  # наша змінна w
a, b = int(input('Введіть а:\n>>> ')), int(input('Введіть b:\n>>> '))  # введення чисел a та b
arr = [randint(0, 100) for i in range(int(input('Введіть довжину масиву:\n>>> ')))]  # масив з рандомних чисел

# створюється масив з числами, які задовольняють умову
numbers = sorted(tuple(filter(lambda x: x % a == 0 and x % b != 0, arr)))
if numbers:  # якщо такі числа є, змінні набуває істинності
    w = True
print(f'Масив з елементами:\n{arr}')  # виведення
print(f'Числа {numbers} є кратними {a} та не кратними {b}' if w
      else f'Таких чисел немає')
