# 49. Задано дві таблиці. Одна містить найменування послуг, а інша - розцінки
# за ці послуги. Видаліть з обох таблиць все, що передує послузі, ціна якої G гривень.
# Гевчук Максим КН-А

service, price = [], []
g = float(input('Введіть число g: '))
for i in range(int(input('Введіть кількість найменувань послуг: '))):

    # у масиви вводяться дані і, якщо ціни передують значенню g, то зразу ж видаляються значення з обох масивів
    service.append(input('Введіть послугу: '))
    price.append(float(input('Введіть ціну за послугу: ')))
    if price[i] < g:
        del service[i], price[i]

print(f'Змінений список найменуваннь послуг:\n{service}')
print(f'Змінений список розцінок за послуги:\n{price}')
