# 50. У лотереї розігрувалося 100 квитків. Таблиця містить 10 номерів виграшних квитків.
# Перевірте, чи є квиток з номером N виграшним.
# Гевчук Максим КН-А

from random import randint

lucky_tickets = [randint(1, 100) for luck in range(10)]  # створюється масив з рандомними числами
n = int(input('Введіть ваш номер білету:\n>>> '))  # введення числа n

# якщо n входить у масив, то виводиться повідомлення
print('You win!!!' if n in lucky_tickets else 'Наступного разу пощастить.')
print(f'Виграшні білети:\n{lucky_tickets}')  # виведення масиву
