# 51. Дан одновимірний масив а. Сформувати новий масив, який складається тільки з тих елементів масиву а,
# які перевищують свій номер на 10. Якщо таких елементів немає, то видати повідомлення.
# Гевчук Максим КН-А

from random import randint

arr = [randint(1, 50) for q in range(100)]  # створюємо новий масив з рандомними елементами розміром 100
new_arr = [arr[i] for i in range(100) if arr[i] == i + 10]  # формуємо новий масив з елементів, які задов. умову
print(*arr)  # виведення масиву а
print('Таких елементів немає.' if not new_arr
      else f'Новий масив:\n{new_arr}')  # якщо масив містить елем. - виведення, якщо ні - відповідне повідомлення
