# 52. Знайти найбільший елемент з елементів одновимірного масиву, що мають парний номер. Визначити, чи є він єдиним.
# Гевчук Максим КН-А

from random import randint

arr = [randint(1, 25) for i in range(50)]  # створення масиву з рандомних чисел
max_elem = max(arr[::2])  # створення масиву з чисел попереднього масиву, які мають парний індекс
print(*arr)  # виведення масиву
print(f'Найбільний елемент: {max_elem}\n'  # виведення найбільшого числа
      f'Знайдений {arr.count(max_elem)} разів')  # та його к-сть у масиві
