# 53. В масиві X (1: n) кожен елемент рівний 0, 1 або 5. Переставити елементи масиву так, щоб спочатку розташовувалися
# всі нулі, потім все одиниці, а потім всі п'ятірки. Додаткового масиву не заводити.
# Гевчук Максим КН-А

from random import choice

arr = [choice((0, 1, 5)) for i in range(int(input('Введіть число n:\n>>> ')))]  # створюємо масив із 0, 1 або 5
print(f'\nМасив:\n{arr}')  # виведення масиву
arr.sort()  # сортування масиву
print(f'\nВідсортований масив:\n{arr}')  # виведення відсортованого масиву
