# 56. Якщо в одновимірному масиві є три поспіль однакових елемента, то змінній r привласнити значення істина.
# Гевчук Максим КН-А

from random import randint

arr = [randint(1, 4) for i in range(15)]  # створюється масив із чисел
r = False

temp = ''.join(map(str, arr))  # елементи масиву стають типу str та додаються до рядку
for item in set(arr):  # будуть перебираютись унікальні елементи
    nums = str(item) * 3  #створюється підрядок з 3 однаковими елементами
    if nums in temp:  # якщо такий підрядок є в рядку, то змінна r набуває значення істини
        r = True
        break
print(*arr)
print(r)
